yh-sb/mcu-framework/src/hal/STM32F4/spi.cpp
static volatile uint32_t *rcc_addr_list[SPI_END] =
{
	&RCC->APB2ENR,
	&RCC->APB1ENR,
	&RCC->APB1ENR,
	&RCC->APB2ENR,
	&RCC->APB2ENR,
	&RCC->APB2ENR
};

static volatile uint32_t *reset_addr_list[SPI_END] =
{
	&RCC->APB2RSTR,
	&RCC->APB1RSTR,
	&RCC->APB1RSTR,
	&RCC->APB2RSTR,
	&RCC->APB2RSTR,
	&RCC->APB2RSTR
};

static rcc_src_t const rcc_src_list[SPI_END] =
{
	RCC_SRC_APB2,
	RCC_SRC_APB1,
	RCC_SRC_APB1,
	RCC_SRC_APB2,
	RCC_SRC_APB2,
	RCC_SRC_APB2
};

static uint8_t const gpio_af_list[SPI_END] =
{
	0x05,
	0x05,
	0x06,
	0x05,
	0x05,
	0x05
};

static GPIO_TypeDef *const gpio_list[PORT_QTY] =
{
	GPIOA, GPIOB, GPIOC,
#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F405xx) || \
	defined(STM32F407xx) || defined(STM32F411xE) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	GPIOD, GPIOE,
#else
	NULL, NULL,
#endif
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	GPIOF, GPIOG,
#else
	NULL, NULL,
#endif
	GPIOH,
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || \
	defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || \
	defined(STM32F479xx)
	GPIOI,
#else
	NULL,
#endif
#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
	GPIOJ, GPIOK
#else
	NULL, NULL
#endif
};

static spi *obj_list[SPI_END];

static void gpio_af_init(spi_t spi, gpio &gpio);
static uint8_t calc_presc(spi_t spi, uint32_t baud);

#if configUSE_TRACE_FACILITY
static traceHandle isr_dma_tx, isr_dma_rx, isr_spi;
#endif

spi::spi(spi_t spi, uint32_t baud, spi_cpol_t cpol, spi_cpha_t cpha,
	spi_bit_order_t bit_order, dma &dma_tx, dma &dma_rx, gpio &mosi,
	gpio &miso, gpio &clk):
	_spi(spi),
	_baud(baud),
	_cpol(cpol),
	_cpha(cpha),
	_bit_order(bit_order),
	api_lock(NULL),
	irq_lock(NULL),
	irq_res(SPI_ERR_NONE),
	_mosi(mosi),
	_miso(miso),
	_clk(clk),
	_cs(NULL),
	tx_dma(dma_tx),
	tx_buff(NULL),
	rx_dma(dma_rx),
	rx_buff(NULL),
	rx_irq_res(SPI_ERR_NONE)
{
	ASSERT(_spi < SPI_END && spi_list[_spi]);
	ASSERT(_baud > 0);
	ASSERT(tx_dma.dir() == dma::dir_t::DIR_MEM_TO_PERIPH);
	ASSERT(tx_dma.inc_size() == dma::inc_size_t::INC_SIZE_8);
	ASSERT(rx_dma.dir() == dma::dir_t::DIR_PERIPH_TO_MEM);
	ASSERT(rx_dma.inc_size() == dma::inc_size_t::INC_SIZE_8);
	ASSERT(_mosi.mode() == gpio::mode::AF);
	ASSERT(_miso.mode() == gpio::mode::AF);
	ASSERT(_clk.mode() == gpio::mode::AF);
	
	api_lock = xSemaphoreCreateMutex();
	ASSERT(api_lock);
	irq_lock = xSemaphoreCreateBinary();
	ASSERT(irq_lock);
	
#if configUSE_TRACE_FACILITY
	vTraceSetMutexName((void *)api_lock, "spi_api_lock");
	vTraceSetSemaphoreName((void *)irq_lock, "spi_irq_lock");
	isr_dma_tx = xTraceSetISRProperties("ISR_dma_spi_tx", 1);
	isr_dma_rx = xTraceSetISRProperties("ISR_dma_spi_rx", 1);
	isr_spi = xTraceSetISRProperties("ISR_spi", 1);
#endif
	
	obj_list[_spi] = this;
	
	*rcc_addr_list[_spi] |= rcc_list[_spi];
	*reset_addr_list[_spi] |= reset_list[_spi];
	*reset_addr_list[_spi] &= ~reset_list[_spi];
	
	gpio_af_init(_spi, _mosi);
	gpio_af_init(_spi, _miso);
	gpio_af_init(_spi, _clk);
	
	SPI_TypeDef *spi_base = spi_list[_spi];
	
	// Master mode
	spi_base->CR1 |= SPI_CR1_MSTR;
	
	if(_cpol == SPI_CPOL_0)
		spi_base->CR1 &= ~SPI_CR1_CPOL;
	else
		spi_base->CR1 |= SPI_CR1_CPOL;
	
	if(_cpha == SPI_CPHA_0)
		spi_base->CR1 &= ~SPI_CR1_CPHA;
	else
		spi_base->CR1 |= SPI_CR1_CPHA;
	
	if(_bit_order == SPI_BIT_ORDER_MSB)
		spi_base->CR1 &= ~SPI_CR1_LSBFIRST;
	else
		spi_base->CR1 |= SPI_CR1_LSBFIRST;
	
	// Disable NSS hardware management
	spi_base->CR1 |= SPI_CR1_SSM | SPI_CR1_SSI;
	
	uint8_t presc = calc_presc(_spi, _baud);
	spi_base->CR1 |= ((presc << SPI_CR1_BR_Pos) & SPI_CR1_BR);
	
	spi_base->CR2 &= ~(SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
	
	// TODO: overrun error has happend each time with this bit
	//spi_base->CR2 |= SPI_CR2_ERRIE;
	
	spi_base->CR1 |= SPI_CR1_SPE;
	
	tx_dma.dst((uint8_t *)&spi_base->DR);
	rx_dma.src((uint8_t *)&spi_base->DR);
	
	NVIC_ClearPendingIRQ(irq_list[_spi]);
	NVIC_SetPriority(irq_list[_spi], IRQ_PRIORITY);
	NVIC_EnableIRQ(irq_list[_spi]);
}

spi::~spi()
{
	*reset_addr_list[_spi] |= reset_list[_spi];
	*reset_addr_list[_spi] &= ~reset_list[_spi];
	*rcc_addr_list[_spi] &= ~rcc_list[_spi];
}

void spi::baud(uint32_t baud)
{
	ASSERT(baud > 0);
	
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	uint8_t presc = calc_presc(_spi, _baud);
	
	_baud = baud;
	SPI_TypeDef *spi = spi_list[_spi];
	
	spi->CR1 &= ~(SPI_CR1_SPE | SPI_CR1_BR);
	spi->CR1 |= ((presc << SPI_CR1_BR_Pos) & SPI_CR1_BR) | SPI_CR1_SPE;
	
	xSemaphoreGive(api_lock);
}

void spi::cpol(spi_cpol_t cpol)
{
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_cpol = cpol;
	SPI_TypeDef *spi = spi_list[_spi];
	
	spi->CR1 &= ~SPI_CR1_SPE;
	
	if(_cpol == SPI_CPOL_0)
		spi->CR1 &= ~SPI_CR1_CPOL;
	else
		spi->CR1 |= SPI_CR1_CPOL;
	
	spi->CR1 |= SPI_CR1_SPE;
	
	xSemaphoreGive(api_lock);
}

void spi::cpha(spi_cpha_t cpha)
{
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_cpha = cpha;
	SPI_TypeDef *spi = spi_list[_spi];
	
	spi->CR1 &= ~SPI_CR1_SPE;
	
	if(_cpha == SPI_CPHA_0)
		spi->CR1 &= ~SPI_CR1_CPHA;
	else
		spi->CR1 |= SPI_CR1_CPHA;
	
	spi->CR1 |= SPI_CR1_SPE;
	
	xSemaphoreGive(api_lock);
}

void spi::bit_order(spi_bit_order_t bit_order)
{
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_bit_order = bit_order;
	SPI_TypeDef *spi = spi_list[_spi];
	
	spi->CR1 &= ~SPI_CR1_SPE;
	
	if(_bit_order == SPI_BIT_ORDER_MSB)
		spi->CR1 &= ~SPI_CR1_LSBFIRST;
	else
		spi->CR1 |= SPI_CR1_LSBFIRST;
	
	spi->CR1 |= SPI_CR1_SPE;
	
	xSemaphoreGive(api_lock);
}

int8_t spi::tx(void *buff, uint16_t size, gpio *cs)
{
	ASSERT(buff);
	ASSERT(size > 0);
	
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
