yh-sb/mcu-framework/src/hal/STM32F4/spi.cpp
	_cs = cs;
	if(_cs)
		_cs->set(0);
	
	tx_buff = buff;
	tx_dma.src((uint8_t*)tx_buff);
	tx_dma.size(size);
	tx_dma.start_once(on_dma_tx, this);
	spi_list[_spi]->CR2 |= SPI_CR2_TXDMAEN;
	
	/* Task will be blocked during spi tx operation */
	/* irq_lock will be given later from irq handler */
	xSemaphoreTake(irq_lock, portMAX_DELAY);
	
	xSemaphoreGive(api_lock);
	
	return irq_res;
}

int8_t spi::tx(uint8_t byte, gpio *cs)
{
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_cs = cs;
	if(_cs)
		_cs->set(0);
	
	tx_buff = &byte;
	tx_dma.src((uint8_t*)tx_buff);
	tx_dma.size(1);
	tx_dma.start_once(on_dma_tx, this);
	spi_list[_spi]->CR2 |= SPI_CR2_TXDMAEN;
	
	/* Task will be blocked during spi tx operation */
	/* irq_lock will be given later from irq handler */
	xSemaphoreTake(irq_lock, portMAX_DELAY);
	
	xSemaphoreGive(api_lock);
	
	return irq_res;
}

int8_t spi::rx(void *buff, uint16_t size, gpio *cs)
{
	ASSERT(buff);
	ASSERT(size > 0);
	
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_cs = cs;
	if(_cs)
		_cs->set(0);
	
	rx_buff = buff;
	rx_dma.dst((uint8_t*)rx_buff);
	rx_dma.size(size);
	rx_dma.start_once(on_dma_rx, this);
	
	/* Setup tx for reception */
	tx_buff = rx_buff;
	tx_dma.src((uint8_t*)tx_buff);
	tx_dma.size(size);
	tx_dma.start_once(on_dma_tx, this);
	spi_list[_spi]->DR;
	spi_list[_spi]->CR2 |= SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN;
	
	/* Task will be blocked during spi rx operation */
	/* irq_lock will be given later from irq handler */
	xSemaphoreTake(irq_lock, portMAX_DELAY);
	
	xSemaphoreGive(api_lock);
	
	return irq_res;
}

int8_t spi::exch(void *buff_tx, void *buff_rx, uint16_t size, gpio *cs)
{
	ASSERT(buff_tx);
	ASSERT(buff_rx);
	ASSERT(size > 0);
	
	xSemaphoreTake(api_lock, portMAX_DELAY);
	
	_cs = cs;
	if(_cs)
		_cs->set(0);
	
	rx_buff = buff_rx;
	rx_dma.src((uint8_t*)rx_buff);
	rx_dma.size(size);
	rx_dma.start_once(on_dma_rx, this);
	spi_list[_spi]->DR;
	
	tx_buff = buff_tx;
	tx_dma.src((uint8_t*)tx_buff);
	tx_dma.size(size);
	tx_dma.start_once(on_dma_tx, this);
	
	spi_list[_spi]->CR2 |= SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN;
	
	/* Task will be blocked during spi exch operation */
	/* irq_lock will be given later from irq handler */
	xSemaphoreTake(irq_lock, portMAX_DELAY);
	
	xSemaphoreGive(api_lock);
	
	return irq_res;
}

static void gpio_af_init(spi_t spi, gpio &gpio)
{
	GPIO_TypeDef *gpio_reg = gpio_list[gpio.port()];
	
	uint8_t pin = gpio.pin();
	/* Push-pull type */
	gpio_reg->OTYPER &= ~(GPIO_OTYPER_OT_0 << pin);
	
	/* Configure alternate function */
	if(pin < 8)
	{
		gpio_reg->AFR[0] &= ~(0x0F << (pin * 4));
		gpio_reg->AFR[0] |= gpio_af_list[spi] << (pin * 4);
	}
	else
	{
		gpio_reg->AFR[1] &= ~(0x0F << ((pin - 8) * 4));
		gpio_reg->AFR[1] |= gpio_af_list[spi] << ((pin - 8) * 4);
	}
}

static uint8_t calc_presc(spi_t spi, uint32_t baud)
{
	uint32_t div = rcc_get_freq(rcc_src_list[spi]) / baud;
	
	/* Baud rate is too low or too high */
	ASSERT(div > 1 && div <= 256);
	
	uint8_t res = 0;
	/* Calculate how many times div can be divided by 2 */
	while((div /= 2) > 1)
		res++;
	
	return res;
}

void spi::on_dma_tx(dma *dma, dma::event_t event, void *ctx)
{
	if(event == dma::event_t::EVENT_HALF)
		return;
#if configUSE_TRACE_FACILITY
	vTraceStoreISRBegin(isr_dma_tx);
#endif
	spi *obj = static_cast<spi *>(ctx);
	BaseType_t hi_task_woken = 0;
	
	obj->tx_buff = NULL;
	SPI_TypeDef *spi = spi_list[obj->_spi];
	
	spi->CR2 &= ~SPI_CR2_TXDMAEN;
	if(event == dma::event_t::EVENT_CMPLT)
	{
		if(obj->rx_buff)
		{
#if configUSE_TRACE_FACILITY
			vTraceStoreISREnd(hi_task_woken);
#endif
			return;
		}
		spi->CR2 |= SPI_CR2_TXEIE;
	}
	else if(event == dma::event_t::EVENT_ERROR)
	{
		if(obj->rx_buff)
		{
			spi->CR2 &= ~SPI_CR2_RXDMAEN;
			obj->rx_dma.stop();
			obj->rx_buff = NULL;
		}
		
		if(obj->_cs)
		{
			obj->_cs->set(1);
			obj->_cs = NULL;
		}
		
		obj->irq_res = SPI_ERR_FAIL;
		xSemaphoreGiveFromISR(obj->irq_lock, &hi_task_woken);
		portYIELD_FROM_ISR(hi_task_woken);
	}
	
#if configUSE_TRACE_FACILITY
	vTraceStoreISREnd(hi_task_woken);
#endif
}

void spi::on_dma_rx(dma *dma, dma::event_t event, void *ctx)
{
	if(event == dma::event_t::EVENT_HALF)
		return;
#if configUSE_TRACE_FACILITY
	vTraceStoreISRBegin(isr_dma_rx);
#endif
	spi *obj = static_cast<spi *>(ctx);
	SPI_TypeDef *spi = spi_list[obj->_spi];
	
	obj->rx_buff = NULL;
	spi->CR2 &= ~SPI_CR2_RXDMAEN;
	if(event == dma::event_t::EVENT_CMPLT)
		obj->irq_res = SPI_ERR_NONE;
	else if(event == dma::event_t::EVENT_ERROR)
		obj->irq_res = SPI_ERR_FAIL;
	
	if(obj->_cs)
	{
		obj->_cs->set(1);
		obj->_cs = NULL;
	}
	
	BaseType_t hi_task_woken = 0;
	xSemaphoreGiveFromISR(obj->irq_lock, &hi_task_woken);
	portYIELD_FROM_ISR(hi_task_woken);
#if configUSE_TRACE_FACILITY
	vTraceStoreISREnd(hi_task_woken);
#endif
}

extern "C" void spi_irq_hndlr(hal::spi *obj)
{
	SPI_TypeDef *spi = spi_list[obj->_spi];
	uint32_t sr = spi->SR;
	uint32_t dr = spi->DR;
#if configUSE_TRACE_FACILITY
	vTraceStoreISRBegin(isr_spi);
#endif
	
	if((spi->CR2 & SPI_CR2_TXEIE) && (sr & SPI_SR_TXE))
	{
		spi->CR2 &= ~(SPI_CR2_TXEIE | SPI_CR2_TXDMAEN);
		/* Wait for last byte transmission/receiving */
		while(spi->SR & SPI_SR_BSY);
		obj->irq_res = SPI_ERR_NONE;
	}
	else if((spi->CR2 & SPI_CR2_ERRIE) &&
		(sr & (SPI_SR_UDR | SPI_SR_MODF | SPI_SR_OVR)))
	{
		spi->CR2 &= ~(SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
		if(obj->tx_buff)
		{
			obj->tx_dma.stop();
			obj->tx_buff = NULL;
		}
		if(obj->rx_buff)
		{
			obj->rx_dma.stop();
			obj->rx_buff = NULL;
		}
		obj->irq_res = SPI_ERR_FAIL;
	}
	
	if(obj->_cs)
	{
		obj->_cs->set(1);
		obj->_cs = NULL;
	}
	
	BaseType_t hi_task_woken = 0;
	xSemaphoreGiveFromISR(obj->irq_lock, &hi_task_woken);
#if configUSE_TRACE_FACILITY
	vTraceStoreISREnd(hi_task_woken);
#endif
	portYIELD_FROM_ISR(hi_task_woken);
}

extern "C" void SPI1_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_1]);
}

#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F405xx) || \
	defined(STM32F407xx) || defined(STM32F410Cx) || defined(STM32F410Rx) || \
	defined(STM32F411xE) || defined(STM32F412Cx) || defined(STM32F412Rx) || \
	defined(STM32F412Vx) || defined(STM32F412Zx) || defined(STM32F413xx) || \
	defined(STM32F415xx) || defined(STM32F417xx) || defined(STM32F423xx) || \
	defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || \
	defined(STM32F479xx)
extern "C" void SPI2_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_2]);
}
#endif

