yh-sb/mcu-framework/src/hal/STM32F4/spi.cpp
#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F405xx) || \
	defined(STM32F407xx) || defined(STM32F411xE) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
extern "C" void SPI3_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_3]);
}
#endif

#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE) || \
	defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || \
	defined(STM32F412Zx) || defined(STM32F413xx) || defined(STM32F423xx) || \
	defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || \
	defined(STM32F479xx)
extern "C" void SPI4_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_4]);
}
#endif

#if defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F411xE) || \
	defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || \
	defined(STM32F412Zx) || defined(STM32F413xx) || defined(STM32F423xx) || \
	defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
extern "C" void SPI5_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_5]);
}
#endif

#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
extern "C" void SPI6_IRQHandler(void)
{
	spi_irq_hndlr(obj_list[SPI_6]);
}
#endif
